Tekla Open API Reference for Tekla Structures 2025
AngleDimensionAttributes Constructor
Overload List
Name | Description
AngleDimensionAttributes()
 Creates a new angle dimension attributes instance which loads standard attributes.
AngleDimensionAttributes(String)
 Creates a new angle dimension attributes instance that loads the specified attributes.
Top
See Also
Reference
AngleDimensionAttributes Class
Tekla.Structures.Drawing Namespace